apache/nuttx/arch/arm/src/rp2040/hardware/rp2040_uart01.h
/****************************************************************************
 * arch/arm/src/rp2040/hardware/rp2040_uart01.h
 *
 * SPDX-License-Identifier: BSD-3-Clause
 * SPDX-FileCopyrightText: 2020 Raspberry Pi (Trading) Ltd.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name of the copyright holder nor the names of its
 *    contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/

#ifndef __ARCH_ARM_SRC_RP2040_HARDWARE_RP2040_UART01_H
#define __ARCH_ARM_SRC_RP2040_HARDWARE_RP2040_UART01_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include "hardware/rp2040_memorymap.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Register offsets *********************************************************/

#define RP2040_UART_UARTDR_OFFSET         0x000000  /* Data Register, UARTDR */
#define RP2040_UART_UARTRSR_OFFSET        0x000004  /* Receive Status Register/Error Clear Register, UARTRSR/UARTECR */
#define RP2040_UART_UARTFR_OFFSET         0x000018  /* Flag Register, UARTFR */
#define RP2040_UART_UARTILPR_OFFSET       0x000020  /* IrDA Low-Power Counter Register, UARTILPR */
#define RP2040_UART_UARTIBRD_OFFSET       0x000024  /* Integer Baud Rate Register, UARTIBRD */
#define RP2040_UART_UARTFBRD_OFFSET       0x000028  /* Fractional Baud Rate Register, UARTFBRD */
#define RP2040_UART_UARTLCR_H_OFFSET      0x00002c  /* Line Control Register, UARTLCR_H */
#define RP2040_UART_UARTCR_OFFSET         0x000030  /* Control Register, UARTCR */
#define RP2040_UART_UARTIFLS_OFFSET       0x000034  /* Interrupt FIFO Level Select Register, UARTIFLS */
#define RP2040_UART_UARTIMSC_OFFSET       0x000038  /* Interrupt Mask Set/Clear Register, UARTIMSC */
#define RP2040_UART_UARTRIS_OFFSET        0x00003c  /* Raw Interrupt Status Register, UARTRIS */
#define RP2040_UART_UARTMIS_OFFSET        0x000040  /* Masked Interrupt Status Register, UARTMIS */
#define RP2040_UART_UARTICR_OFFSET        0x000044  /* Interrupt Clear Register, UARTICR */
#define RP2040_UART_UARTDMACR_OFFSET      0x000048  /* DMA Control Register, UARTDMACR */
#define RP2040_UART_UARTPERIPHID0_OFFSET  0x000fe0  /* UARTPeriphID0 Register */
#define RP2040_UART_UARTPERIPHID1_OFFSET  0x000fe4  /* UARTPeriphID1 Register */
#define RP2040_UART_UARTPERIPHID2_OFFSET  0x000fe8  /* UARTPeriphID2 Register */
#define RP2040_UART_UARTPERIPHID3_OFFSET  0x000fec  /* UARTPeriphID3 Register */
#define RP2040_UART_UARTPCELLID0_OFFSET   0x000ff0  /* UARTPCellID0 Register */
#define RP2040_UART_UARTPCELLID1_OFFSET   0x000ff4  /* UARTPCellID1 Register */
#define RP2040_UART_UARTPCELLID2_OFFSET   0x000ff8  /* UARTPCellID2 Register */
#define RP2040_UART_UARTPCELLID3_OFFSET   0x000ffc  /* UARTPCellID3 Register */

/* Register definitions (UART) **********************************************/

#define RP2040_UART0_UARTDR         (RP2040_UART0_BASE + RP2040_UART_UARTDR_OFFSET)
#define RP2040_UART0_UARTRSR        (RP2040_UART0_BASE + RP2040_UART_UARTRSR_OFFSET)
#define RP2040_UART0_UARTFR         (RP2040_UART0_BASE + RP2040_UART_UARTFR_OFFSET)
#define RP2040_UART0_UARTILPR       (RP2040_UART0_BASE + RP2040_UART_UARTILPR_OFFSET)
#define RP2040_UART0_UARTIBRD       (RP2040_UART0_BASE + RP2040_UART_UARTIBRD_OFFSET)
#define RP2040_UART0_UARTFBRD       (RP2040_UART0_BASE + RP2040_UART_UARTFBRD_OFFSET)
#define RP2040_UART0_UARTLCR_H      (RP2040_UART0_BASE + RP2040_UART_UARTLCR_H_OFFSET)
#define RP2040_UART0_UARTCR         (RP2040_UART0_BASE + RP2040_UART_UARTCR_OFFSET)
#define RP2040_UART0_UARTIFLS       (RP2040_UART0_BASE + RP2040_UART_UARTIFLS_OFFSET)
#define RP2040_UART0_UARTIMSC       (RP2040_UART0_BASE + RP2040_UART_UARTIMSC_OFFSET)
#define RP2040_UART0_UARTRIS        (RP2040_UART0_BASE + RP2040_UART_UARTRIS_OFFSET)
#define RP2040_UART0_UARTMIS        (RP2040_UART0_BASE + RP2040_UART_UARTMIS_OFFSET)
#define RP2040_UART0_UARTICR        (RP2040_UART0_BASE + RP2040_UART_UARTICR_OFFSET)
#define RP2040_UART0_UARTDMACR      (RP2040_UART0_BASE + RP2040_UART_UARTDMACR_OFFSET)
#define RP2040_UART0_UARTPERIPHID0  (RP2040_UART0_BASE + RP2040_UART_UARTPERIPHID0_OFFSET)
#define RP2040_UART0_UARTPERIPHID1  (RP2040_UART0_BASE + RP2040_UART_UARTPERIPHID1_OFFSET)
#define RP2040_UART0_UARTPERIPHID2  (RP2040_UART0_BASE + RP2040_UART_UARTPERIPHID2_OFFSET)
#define RP2040_UART0_UARTPERIPHID3  (RP2040_UART0_BASE + RP2040_UART_UARTPERIPHID3_OFFSET)
#define RP2040_UART0_UARTPCELLID0   (RP2040_UART0_BASE + RP2040_UART_UARTPCELLID0_OFFSET)
#define RP2040_UART0_UARTPCELLID1   (RP2040_UART0_BASE + RP2040_UART_UARTPCELLID1_OFFSET)
#define RP2040_UART0_UARTPCELLID2   (RP2040_UART0_BASE + RP2040_UART_UARTPCELLID2_OFFSET)
#define RP2040_UART0_UARTPCELLID3   (RP2040_UART0_BASE + RP2040_UART_UARTPCELLID3_OFFSET)

/* Register definitions (UART1) *********************************************/

